registrationMuster.xml

<?xml version="1.0" encoding="utf-8" ?><s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'><s:Body><Registration xmlns='urn:Microsoft.Search'><registrationXml xsi:type='xsd:string'>&lt;RegistrationRequest revision=&#39;2&#39; build=&#39;(15.0.4551)&#39; xmlns=&#39;urn:Microsoft.Search.Registration.Request&#39;&gt;&lt;OriginatorId&gt;{F6FF7BE0-F39C-4ddc-A7D0-09A4C6C647A5}&lt;/OriginatorId&gt;&lt;SystemInformation&gt;&lt;SkuLanguage&gt;de&lt;/SkuLanguage&gt;&lt;LanguagePack&gt;de&lt;/LanguagePack&gt;&lt;LanguagePack&gt;de&lt;/LanguagePack&gt;&lt;InterfaceLanguage&gt;de&lt;/InterfaceLanguage&gt;&lt;Location&gt;DE&lt;/Location&gt;&lt;/SystemInformation&gt;&lt;/RegistrationRequest&gt;</registrationXml></Registration></s:Body></s:Envelope>