test.txt

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s='http://schemas.xmlsoap.org/soap/envelope/' xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'>
	<s:Body>
		<Query xmlns='urn:Microsoft.Search'>
			<queryXml xsi:type='xsd:string'><QueryPacket xmlns=&#39;urn:Microsoft.Search.Query&#39; revision=&#39;1&#39; build=&#39;(15.0.4551)&#39; ><Query domain=&#39;{1698EF5D-E2F5-EF54-87B2-7FC9E9AB0EEF}&#39;><QueryId>{ED201105-D4D1-497A-9A6F-BDF180A62703}</QueryId><OriginatorId>{F6FF7BE0-F39C-4ddc-A7D0-09A4C6C647A5}</OriginatorId><SupportedFormats><Format revision=&#39;1&#39;>urn:Microsoft.Search.Response.Document:Document</Format><Format revision=&#39;1&#39;>urn:Microsoft.Search.Response.Content:Content</Format><Format revision=&#39;1&#39;>urn:Microsoft.Search.Response.Form:Form</Format></SupportedFormats><Context><QueryText type=&#39;STRING&#39; language=&#39;de&#39; >M&#228;dchen</QueryText><LanguagePreference>de</LanguagePreference><Requery></Requery></Context><Range id=&#39;result&#39;></Range><OfficeContext xmlns=&#39;urn:Microsoft.Search.Query.Office.Context&#39; revision=&#39;1&#39;><UserPreferences><ParentalControl>false</ParentalControl></UserPreferences><ServiceData></ServiceData><ApplicationContext><Name>Microsoft Word</Name><Version>(15.0.4551)</Version><SystemInformation><SkuLanguage>de</SkuLanguage><LanguagePack>de</LanguagePack><LanguagePack>de</LanguagePack><InterfaceLanguage>de</InterfaceLanguage><Location>DE</Location></SystemInformation></ApplicationContext><QueryLanguage>de</QueryLanguage><KeyboardLanguage>de</KeyboardLanguage></OfficeContext><Keywords xmlns=&#39;urn:Microsoft.Search.Query.Office.Keywords&#39; revision=&#39;1&#39;><QueryText>M&#228;dchen</QueryText><Keyword><Word>M&#228;dchen</Word><StemWord>M&#228;dchens</StemWord><StemWord>maedchens</StemWord><StemWord>maedchen</StemWord><StemWord>M&#228;dchen</StemWord></Keyword></Keywords></Query></QueryPacket></queryXml>
		</Query>
	</s:Body>
</s:Envelope>